Tekla Open API Reference for Tekla Structures 2025
IBoundingVolume Interface
 The BoundingVolume interface represents any generic 3D bounding volume.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IBoundingVolume
Public Interface IBoundingVolume
See Also
Reference
Tekla.Structures.Geometry3d Namespace